[
    {
        "ratings": {},
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "I bought this phone on first sale. It looks gud, gives u feel in hand, comfortable grip and gud performance during games. But contrary to ther statement of best camera phone, this one is the worst. Rear camera images r blurr, hazzy and if u zoom they r very grainy. Color reproduction is poor. In portrait mode nothing works properly, it can't differentiate the object from background. In low light degraded performance persists. Talking about front camera images only look gud but when u zoom the images, output is always grainy even in day light. Night images are intermittent u may c same object with same lights n background appears differently some time they r gud but other times they may b out of focus, hazzy and overall images r always grainy.",
                "review_posted_date": "09 Dec 2018",
                "review_header": "Very poor camera performance",
                "review_rating": "2.0 ",
                "review_author": "Ranpreet S Marwah"
            },
            {
                "review_comment_count": "",
                "review_text": "Very good phone. I like the display a lot. It is big enough to enjoy videos.",
                "review_posted_date": "13 Jan 2019",
                "review_header": "Very good phone.",
                "review_rating": "5.0 ",
                "review_author": "Souvik"
            },
            {
                "review_comment_count": "",
                "review_text": "I would say wow for this awesome mobile.. Pros: Camera: Front camera is awesome, Realme gives you a premium front camera on a mid range smartphone. It blurs the background and gives you a better portrait mode than rear camera. Front camera gives you a bright and clear picture even in low light without requiring a front flash. Battery Backup: It has a decent battery backup, im using this mobile for over a week now and I didn't find the battery to be disappointing, for a normal usage it lasts for 1.5 days easily and on heavy usage it lasts for 1 day. Performance: It has a normal performance, it will not disappoint you but yes it has an average performance not too fast but till now it never gave me any problem in terms of performance. Looks: This is the major reason why people would prefer buying this smartphone, believe me U1 has premium built quality, attractive shining bright colours and no one can say that its a mid range smartphone by its looks. Unlocking: This is the best thing which I loved about U1. Face unlock is the best it also works in low light, I have used oneplus 5t and face unlock is the same on both the smartphones. Everything is outstanding at this price.. Believe me you'll not get all this on a different smartphone for this price. If I compare, what vivo is giving for 21k, you are getting those features in 12k (Looks, camera, batter life and other features) If you are looking for performance please purchase oneplus, it has best performance in the market. Cons: I dont wish to mention it personally but just want you guys to know that it doesn't have fast charging. There are no other cons.. Overall its a best smartphone for this price and",
                "review_posted_date": "08 Dec 2018",
                "review_header": "Best smartphone in the market for this price",
                "review_rating": "5.0 ",
                "review_author": "Darshan Sharma"
            },
            {
                "review_comment_count": "",
                "review_text": "I am using from last 1week.... awesome futures with superb look .... it's tooo better then redmi and other mble in market...... Pros... .the water drop display looks rich and amazing display quality . battery charg fast(2hr full charg) and drains slowly even playing pubg continually.... .frant and back cemara are best in this proice .Speaker is decent louder as much as we required .best futures of colour os...etc Con's: I can't find till now any cons ..bcz it's roking.....",
                "review_posted_date": "09 Dec 2018",
                "review_header": "Read before u buy.....and give me one like..",
                "review_rating": "5.0 ",
                "review_author": "Shiva reddy"
            },
            {
                "review_comment_count": "",
                "review_text": "This phone is nothing less than Realme 2 pro but its also an improved version of realme 2 pro and Color OS. Little Bigger display than Realme 2 pro, battery issue which i faced in Realme 2 pro is fixed in U1. It doesn't drain quickly and charges the phone at an average good time. Selfie camera is awesome and primary camera is slightly better than Realme pro 2. Phone's performance is equally same as realme 2 pro, so cant really say about the processor. Both SD 660 and P70 is winner. Design and built quality is same, nothing metallic, so using the free case which I've received along with it . Facing little data connectivity issue, but cant say if the problem is with the phone, it could be network issue. Didn't receive the earphone in the box. Why phone companies have stopped sending earphones with the phone? I guess, there are very few phones which come up with the in-box earphone. Audio quality is good, enjoyed the loudness without earphone, better and louder any other phone. The display is not very bright, it could have been slightly bright like Redmi or Huawei's phones. But the video quality is amazing, you'll love watching movies in FHD and the dewdrop notch is so perfect to make your viewing experience fantastic. Few improvements in Color OS. Finally, we can close the notification by simply sliding towards the right side with the finger. Apps' icons are little smaller in comparison with other realme phones. Its been 1 days since I got my hands on the phone, many more things to see and notice on this phone. Will leave my next review in Jan, 2019",
                "review_posted_date": "09 Dec 2018",
                "review_header": "Value for money. Great phone at this price.",
                "review_rating": "4.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "1. Battery is awesome 2. Rear camera low light performance average but front camera pretty cool 3. I played pubg almost 2 and half hour and battery was drain to 92% to 60% good backup while gaming i faced some minor frame drops playing in high graphics settings and its consume 10% battery in 30 minutes 4. Display is pretty awesome and sound quality superb in this device 1.8 gb ram are available out of 4 gb and 48 gb storage available out of 64 gb Finger print and face unlock is super first over all nice product go for it😊",
                "review_posted_date": "09 Dec 2018",
                "review_header": "Awesome Device",
                "review_rating": "5.0 ",
                "review_author": "Amit Roy"
            },
            {
                "review_comment_count": "",
                "review_text": "Camera is not as expected its like a 13 mp.... Remaimimg all are verry good..",
                "review_posted_date": "08 Dec 2018",
                "review_header": "Camera is not good",
                "review_rating": "3.0 ",
                "review_author": "Satya"
            },
            {
                "review_comment_count": "",
                "review_text": "Good phone. Fast delivery by amazon. Pros 1 camera quality both selfie and back are awesome 2. Battery back up is good 3.Good buid quality 4 finger print and face unlock both works smooth 5 network connectivity and internet speed better than other phone like samsung MI Cons 1 no fast charger take almost 2 hour to charge 100 percent 2 no ear phone 3 no fast charger 4 no notification led",
                "review_posted_date": "08 Dec 2018",
                "review_header": "Real me U1",
                "review_rating": "4.0 ",
                "review_author": "Rahul Joshi"
            },
            {
                "review_comment_count": "",
                "review_text": "I am writing this review after using this phone for 15 days. For a price of 11999 i think this is the best value for your money. I got the 3GB version primarily to watch Youtube and Play PUBG and other games. I am using this as my secondary phone. The Helio P70 chipset is super fast and effective. I did not face any lag while day to day usage or while playing games. The tear drop display looks very nice and attracts a lot of attention. The only Negative thing i could point out about this phone is that my Portronics earphones is not working in this phone. I have to use another company's earphone with this device. I don't know weather this problem is only in my device or with all the devices. And yes one more thing is the Realme Brand name. Not many people know this brand and it kind of get awkward pulling out this blue shiny device in front of everyone. In conclusion i would say that u should definitely buy this phone if ur budget is Rs12000.",
                "review_posted_date": "13 Jan 2019",
                "review_header": "Best Phone in this Budget",
                "review_rating": "5.0 ",
                "review_author": "Siddhant"
            },
            {
                "review_comment_count": "",
                "review_text": "Better than mi and honor. Best decision ever made. Performance is the fabulous. Pubg work daam good",
                "review_posted_date": "08 Dec 2018",
                "review_header": "The best mobile in this Price range",
                "review_rating": "5.0 ",
                "review_author": "shabnam"
            }
        ],
        "url": "https://www.amazon.in/product-reviews/B07HGH3CGB",
        "name": "Realme U1 (Ambitious Black, 3GB RAM, 32GB Storage)",
        "price": "7999.00"
    }
]